'''
start   起始時間
end     結束時間
type    抓取車種
車種對照 {
    '大型車':0,
    '自行車':1,
    '汽車':2,
    '特殊車輛/汽車':3,
    '特殊車輛/機車':4,
    '機車':5
}
'''

SQL_ARGS = {
    'start':'2022-08-21',
    'end':'2022-10-14',
    'type':[2, 3],
}

TABLE_COLUMNS = [
    'infotime', 'district', 'car_type', 'hr_0', 'hr_1', 'hr_2', 'hr_3', 'hr_4', 'hr_5',
    'hr_6', 'hr_7', 'hr_8', 'hr_9', 'hr_10', 'hr_11', 'hr_12', 'hr_13', 'hr_14', 'hr_15',
    'hr_16', 'hr_17', 'hr_18', 'hr_19', 'hr_20', 'hr_21', 'hr_22', 'hr_23'
]

ONSTREET_NAMETYPE = {
    '大型車停車位' : 0,
    '家長接送區' : 2,
    '時段性禁停停車位' : 2,
    '汽車停車位' : 2,
    '汽車身心障礙專用' : 3,
    '裝卸貨專用停車位' : 0
}

DISTRICT_COMPARISON = {
    '板橋' : 1,
    '中和' : 2,
    '新莊' : 3,
    '三重' : 4,
    '新店' : 5,
    '土城' : 6,
    '永和' : 7,
    '蘆洲' : 8,
    '汐止' : 9,
    '樹林' : 10,
    '淡水' : 11,
    '三峽' : 12,
    '鶯歌' : 13,
    '林口' : 14,
    '五股' : 15,
    '泰山' : 16,
    '瑞芳' : 17,
    '八里' : 18,
    '深坑' : 19,
    '三芝' : 20,
    '金山' : 21,
    '萬里' : 22,
    '貢寮' : 23,
    '石門' : 24,
    '雙溪' : 25,
    '石碇' : 26,
    '坪林' : 27,
    '烏來' : 28,
    '平溪' : 29
}