TABLE_COLUMNS = ['year', 'district', 'area', 'car_type', 'hr_0', 'hr_1', 'hr_2', 'hr_3', 'hr_4',
    'hr_5', 'hr_6', 'hr_7', 'hr_8', 'hr_9', 'hr_10', 'hr_11', 'hr_12', 'hr_13', 'hr_14', 'hr_15', 'hr_16', 
    'hr_17', 'hr_18', 'hr_19', 'hr_20', 'hr_21', 'hr_22', 'hr_23', 'is_workday']

ARGS = {
    'path':'./SupplyDemandTable/供需調查',
    'system_type':['multi'], # single, multi
    'year':['110', '111'],
    'calendar':['假日', '平日'],
    'vehicle_types':['大型車', '自行車', '汽車', '特殊車輛/汽車', '特殊車輛/機車', '機車'],
}

VEH_CODE = {
    '大型車':0,
    '自行車':1,
    '汽車':2,
    '特殊車輛/汽車':3,
    '特殊車輛/機車':4,
    '機車':5
}

IS_WORKDAY = {
    '假日':0,
    '平日':1
}

DATA_PROCESS = {
    'del_to4':['大型車', '自行車', '汽車', '特殊車輛/汽車', '特殊車輛/機車', '機車'],
    'del_last':['大型車', '特殊車輛/機車']
}

USED_COLUMNS = {
    'single_system':{
        '大型車':{
            'demand':[2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
            'supply':[0, 1]
        },
        '自行車':{
            'demand':[4, 5, 6, 7, 8, 9],
            'supply':[0, 1, 2, 3]
        },
        '汽車':{
            'demand':[4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
            'supply':[0, 1, 2, 3]
        },
        '特殊車輛/汽車':{
            'demand':[6, 7, 8, 9, 10, 11, 15],
            'supply':[0, 1, 2, 3, 4, 5, 14]
        },
        '特殊車輛/機車':{
            'demand':[4, 5, 6, 7],
            'supply':[0, 1, 2, 3]
        },
        '機車':{
            'demand':[8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 26],
            'supply':[0, 1, 2, 3, 4, 5, 6, 7, 25]
        }
    },
    'multi_system':{
        '大型車':{
            'demand':[2, 3, 4, 5, 6, 7, 8, 9],
            'supply':[0]
        },
        '自行車':{
            'demand':[4, 5, 6, 7],
            'supply':[0, 1]
        },
        '汽車':{
            'demand':[5, 6, 7, 8, 9, 10, 11],
            'supply':[1]
        },
        '特殊車輛/汽車':{
            'demand':[9, 10, 11],
            'supply':[0, 1, 2, 14]
        },
        '特殊車輛/機車':{
            'demand':[4, 5],
            'supply':[0, 1]
        },
        '機車':{
            'demand':[9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 26],
            'supply':[1, 3, 7, 25]
        }
    }
}

INTERPOLATION_RULES = {
    '假日':{
        '08':['11', '12', '13'],
        '09':['11', '12', '13'],
        '10':['11', '12', '13'],
        '11':['12', '13'],
        '12':['13'],
        '13':['12'],
        '14':['13', '12'],
        '15':['16', '17'],
        '16':['17'],
        '19':['18'],
        '20':['19', '18'],
        '21':['20', '19', '18'],
        '22':['20', '19', '18'],
        '23':['20', '19', '18']
    },
    '平日':{
        '08':['09'],
        '14':['13'],
        '15':['13'],
        '16':['17'],
        '22':['21'],
        '23':['21']
    }
}